In [5]:
import sys
sys.path.append('./TC_03_Sprint_09_ToolBox')

In [6]:
from toolbox_ML import describe_df

In [7]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df

,sex,age,sibsp,parch,fare,class,who,adult_male,embark_town,alive,alone
0,male,22.0,1,0,7.2500,Third,man,True,Southampton,no,False
1,female,38.0,1,0,71.2833,First,woman,False,Cherbourg,yes,False
2,female,26.0,0,0,7.9250,Third,woman,False,Southampton,yes,True
3,female,35.0,1,0,53.1000,First,woman,False,Southampton,yes,False
4,male,35.0,0,0,8.0500,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,Second,man,True,Southampton,no,True
887,female,19.0,0,0,30.0000,First,woman,False,Southampton,yes,True
888,female,32.0,1,2,23.4500,Third,woman,False,Southampton,no,False
889,male,26.0,0,0,30.0000,First,man,True,Cherbourg,yes,True
890,male,32.0,0,0,7.7500,Third,man,True,Queenstown,no,True

In [8]:
describe_df(df)

,sex,age,sibsp,parch,fare,class,who,adult_male,embark_town,alive,alone
DATA_TYPE,object,float64,int64,int64,float64,object,object,bool,object,object,bool
MISSINGS(%),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
UNIQUE_VALUES,2,89,7,7,248,3,3,2,3,2,2
CARDIN(%),0.22,9.99,0.79,0.79,27.83,0.34,0.34,0.22,0.34,0.22,0.22

In [9]:
from toolbox_ML import tipifica_variables

In [10]:
tipifica_variables(df, umbral_categoria=5, umbral_continua=50.0)

   nombre_variable      tipo_sugerido
0              sex            Binaria
1              age  Numérica Discreta
2            sibsp  Numérica Discreta
3            parch  Numérica Discreta
4             fare  Numérica Discreta
5            class         Categórica
6              who         Categórica
7       adult_male            Binaria
8      embark_town         Categórica
9            alive            Binaria
10           alone            Binaria

In [12]:
from toolbox_ML import selecciona_variables_corr

In [30]:
selecciona_variables_corr(df, target_col="sibsp", umbral_corr=0.1)

['age', 'parch', 'fare']